Rahix/avr-device/vendor/attiny13a.atdf
        <register caption="Stack Pointer Low Byte" name="SPL" offset="0x5D" size="1" mask="0xFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Pull-up Disable" mask="0x40" name="PUD"/>
          <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
          <bitfield caption="Sleep Mode Select Bits" mask="0x18" name="SM" values="CPU_SLEEP_MODE2"/>
          <bitfield caption="Interrupt Sense Control 0 bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL2"/>
        </register>
        <register caption="MCU Status register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-On Reset Flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Register" name="OSCCAL" offset="0x51" size="1" mask="0x7F" ocd-rw="R">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Clock Prescale Register" name="CLKPR" offset="0x46" size="1" ocd-rw="R">
          <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
          <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
        </register>
        <register caption="Debug Wire Data Register" name="DWDR" offset="0x4E" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="Store Program Memory Control and Status Register" name="SPMCSR" offset="0x57" size="1" ocd-rw="R">
          <bitfield caption="Clear Temporary Page Buffer" mask="0x10" name="CTPB"/>
          <bitfield caption="Read Fuse and Lock Bits" mask="0x08" name="RFLB"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
        <register caption="Power Reduction Register" name="PRR" offset="0x45" size="1" ocd-rw="R">
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x02" name="PRTIM0"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register caption="BOD Control Register" name="BODCR" offset="0x50" size="1" ocd-rw="R">
          <bitfield caption="BOD Power-Down in Power-Down Sleep" mask="0x02" name="BODS"/>
          <bitfield caption="BOD Power-Down Sleep Enable" mask="0x01" name="BODSE"/>
        </register>
      </register-group>
      <value-group caption="" name="CPU_SLEEP_MODE2">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Reserved" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
        <value caption="256" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="9.6 MHz" name="9_6_MHz"/>
        <value value="0x01" caption="4.8 MHz" name="4_8_MHz"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V2"/>
        <param name="NEW_INSTRUCTIONS" value="lpm rd,z+"/>
      </parameters>
    </module>
  </modules>
  <pinouts>
    <pinout name="PDIP8_SOIC8">
      <pin pad="PB5" position="1"/>
      <pin pad="PB3" position="2"/>
      <pin pad="PB4" position="3"/>
      <pin pad="GND" position="4"/>
      <pin pad="PB0" position="5"/>
      <pin pad="PB1" position="6"/>
      <pin pad="PB2" position="7"/>
      <pin pad="VCC" position="8"/>
    </pinout>
    <pinout name="MLF20">
      <pin pad="PB5" position="1"/>
      <pin pad="PB3" position="2"/>
      <pin pad="PB4" position="5"/>
      <pin pad="PB0" position="11"/>
      <pin pad="PB1" position="12"/>
      <pin pad="PB2" position="14"/>
      <pin pad="VCC" position="15"/>
      <pin pad="GND" position="21"/>
    </pinout>
    <pinout name="MLF10">
      <pin pad="PB5" position="1"/>
      <pin pad="PB3" position="2"/>
      <pin pad="PB4" position="4"/>
      <pin pad="GND" position="5"/>
      <pin pad="PB0" position="6"/>
      <pin pad="PB1" position="7"/>
      <pin pad="PB2" position="9"/>
      <pin pad="VCC" position="10"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
